Revit 2026 API
DirectShapeType.AppendShape Method
Overload List
Name | Description
AppendShape(IList<GeometryObject>)
AppendShape(ShapeBuilder) |  Append shape built by the supplied ShapeBuilderObject to shape representation stored in this DirectShapeType. The data stored in the supplied ShapeBuilder object will be cleared.
AppendShape(IList<GeometryObject>, DirectShapeTargetViewType)
Top
See Also
Reference
DirectShapeType Class
Autodesk.Revit.DB Namespace